---
type: PipeFittingAndAccessoryPressureDropUIDataItem
namespace: Autodesk.Revit.UI.Plumbing
version: 2024
members: 5
tags: [revit-api, class]
---

# PipeFittingAndAccessoryPressureDropUIDataItem

`Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetEntity | 2014 | `public Entity GetEntity ()` |
| Method | GetPipeFittingAndAccessoryData | 2014 | `public PipeFittingAndAccessoryData GetPipeFittingAndAccessoryData ()` |
| Method | SetEntity | 2014 | `public void SetEntity ( Entity entity )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |